Examinator/src/Catalogs/ТерминыСУЗ/ТерминыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТерминыСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>БукваДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Синонимы</name>
    <comment>Синонимы</comment>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>БукваДляПоиска</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ОпределенияТерминаСУЗ/ОпределенияТерминаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОпределенияТерминаСУЗ</name>
  <owners>Catalog.ТерминыСУЗ</owners>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСлева</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженоИзФайла</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ТерминыСУЗ/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭлектронныйРесурс = Параметры.ЭлектронныйРесурс;
	ЭлементГлоссария  = Параметры.ЭлементГлоссария;
	Глоссарий         = Параметры.Глоссарий;
	
	РазработкаСУЗ.УстановитьРодителяНовогоОбъекта(Объект, Параметры, "СправочникСсылка.ТерминыСУЗ");
		
	//////////////////////////////////////////////////////////////////
	
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	
	// Устанавливаем доступность данных от поставщика
	
	ТаблицаДоступностиДанныхПоставщика = РазработкаСУЗ.ПолучитьТаблицуДоступностиДанныхПоставщика();

	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.Определения;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект, ТаблицаДоступностиДанныхПоставщика);
	
	//////////////////////////////////////////////////////////////////
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РазработкаСУЗКлиент.УстановитьКонтекстЭлектронногоРесурса(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьЕдинственноеОпределение();

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ НесколькоОпределений Тогда
	
		Если ЗначениеЗаполнено(ОпределениеУпрощенноеСсылка) Тогда
			
			ОпределениеУпрощенноеОбъект = ОпределениеУпрощенноеСсылка.ПолучитьОбъект();
			
		Иначе
			
			ОпределениеУпрощенноеОбъект = Справочники.ОпределенияТерминаСУЗ.СоздатьЭлемент();
			ОпределениеУпрощенноеОбъект.Владелец = ТекущийОбъект.Ссылка;
			
			РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ОпределениеУпрощенноеОбъект);
			
		КонецЕсли;
		
		ОпределениеУпрощенноеОбъект.Текст = ОпределениеУпрощенноеТекст;
		ОпределениеУпрощенноеОбъект.Элемент = ОпределениеУпрощенноеРесурс;
		
		ОпределениеУпрощенноеОбъект.Записать();
		
	КонецЕсли;
	
	
	
	Если ЗначениеЗаполнено(ЭлементГлоссария) Тогда
		Справочники.СодержаниеГлоссарияСУЗ.Перезаписать(ЭлементГлоссария);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьЕдинственноеОпределение();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ТерминЗаписан", Объект.Ссылка, ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		Оповестить("ЭлектронныйРесурсОбновлен", ЭлектронныйРесурс, ЭтотОбъект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Глоссарий) Тогда
		Оповестить("ГлоссарийОбновлен", Глоссарий, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Объект.БукваДляПоиска = РазработкаСУЗКлиентСервер.ПолучитьБуквуДляПоиска(Объект.Наименование);
КонецПроцедуры

&НаКлиенте
Процедура БукваДляПоискаПриИзменении(Элемент)
	Объект.БукваДляПоиска = ВРег(Объект.БукваДляПоиска);
КонецПроцедуры

&НаКлиенте
Процедура ОпределениеУпрощенноеРесурсОткрытие(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаОткрытияРесурса(Элемент, СтандартнаяОбработка, ОпределениеУпрощенноеРесурс);
КонецПроцедуры

&НаКлиенте
Процедура ОпределениеУпрощенноеРесурсСоздание(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаСозданияРесурса(ЭтотОбъект, Элемент, СтандартнаяОбработка,,ЭлектронныйРесурс);
КонецПроцедуры

&НаКлиенте
Процедура ОпределениеУпрощенноеРесурсОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаВыбораРесурса(ВыбранноеЗначение);
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОпределениеТермина

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ОпределениеТермина

&НаКлиенте
Процедура ОпределенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСинонимы

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Синонимы

&НаКлиенте
Процедура СинонимПредставлениеПриИзменении(Элемент)
	Элементы.Синонимы.ТекущиеДанные.БукваДляПоиска = РазработкаСУЗКлиентСервер.ПолучитьБуквуДляПоиска(Элемент.ТекстРедактирования);	
КонецПроцедуры

&НаКлиенте
Процедура СинонимБукваДляПоискаПриИзменении(Элемент)
	Элементы.Синонимы.ТекущиеДанные.БукваДляПоиска = Врег(Элементы.Синонимы.ТекущиеДанные.БукваДляПоиска);
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура НесколькоОпределений(Команда)
	
	Если НесколькоОпределений Тогда
		
		ОписаниеОпределения = ОписаниеЕдинственногоОпределения(Объект.Ссылка);
		
		Если ОписаниеОпределения = Неопределено Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Невозможно перейти в режим одного определения'"));
			Возврат;
		Иначе
			НесколькоОпределений = Ложь;
			УстановитьЕдинственноеОпределение();
		КонецЕсли;
		
	Иначе
		
		НесколькоОпределений = Истина;
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	// Видимость
	
	Элементы.ГруппаОпределениеУпрощенное.Видимость = НЕ НесколькоОпределений;
	Элементы.Определения.Видимость = НесколькоОпределений;
	
	Элементы.НесколькоОпределений.Пометка = НесколькоОпределений;
	
	// Отборы
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Определения, Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОписаниеЕдинственногоОпределения(Термин)
	
	ОписаниеОпределения = Новый Структура("Ссылка, Текст, Ресурс", Неопределено, "", Неопределено);
	
	Если НЕ ЗначениеЗаполнено(Термин) Тогда
		Возврат ОписаниеОпределения;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОпределенияТерминаСУЗ.Ссылка,
		|	ОпределенияТерминаСУЗ.Текст,
		|	ОпределенияТерминаСУЗ.Элемент КАК Ресурс
		|ИЗ
		|	Справочник.ОпределенияТерминаСУЗ КАК ОпределенияТерминаСУЗ
		|ГДЕ
		|	ОпределенияТерминаСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И ОпределенияТерминаСУЗ.Владелец = &Термин";

	Запрос.УстановитьПараметр("Термин", Термин);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		
		Возврат ОписаниеОпределения; // Пустое определение
		
	КонецЕсли;
	
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		
		ВыборкаДетальныеЗаписи.Следующий();

		Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ресурс) ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.Ресурс) = Тип("СправочникСсылка.РесурсыСУЗ") Тогда
			
			 ОписаниеОпределения.Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
			 ОписаниеОпределения.Текст  = ВыборкаДетальныеЗаписи.Текст;
			 ОписаниеОпределения.Ресурс = ВыборкаДетальныеЗаписи.Ресурс;
			 
			 Возврат ОписаниеОпределения;
			 
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьЕдинственноеОпределение()
	
	ОписаниеОпределения = ОписаниеЕдинственногоОпределения(Объект.Ссылка);
	
	Если ОписаниеОпределения = Неопределено Тогда
		
		НесколькоОпределений = Истина;
		
	Иначе
		
		НесколькоОпределений = Ложь;
		
		ОпределениеУпрощенноеТекст  = ОписаниеОпределения.Текст;
		ОпределениеУпрощенноеСсылка = ОписаниеОпределения.Ссылка;
		ОпределениеУпрощенноеРесурс = ОписаниеОпределения.Ресурс;
		
	КонецЕсли;	
	
	УстановитьДоступностьЭлементовФормы();	
	
КонецПроцедуры

#КонецОбласти
